In [66]:
import sqlalchemy
import pymysql
from sqlalchemy import create_engine 
import pandas as pd

In [67]:
password = "765678aA"
db_name = "LDS2"

In [68]:
conn = pymysql.connect(host='127.0.0.1', port = 3306, user ='root',password=password, database = db_name)

In [69]:
connection = create_engine("mysql+pymysql://root:" + password + "@localhost:3306/" + db_name)

In [89]:
table_name ='People'
table_name2 ='Academics'
table_name3 ='Employment'
table_name4 ='Hobbies'
table_name5 ='Beef'

In [103]:
people = pd.read_csv('/Users/johnle/Downloads/LDS2_Data_ppl.csv')
people.to_sql(name=table_name, con=connection, if_exists='replace', index=False)

In [102]:
academics = pd.read_csv('/Users/johnle/Downloads/LDS2_Data_academics.csv')
academics.to_sql(name=table_name2, con=connection, if_exists='replace', index=False)

Exception during reset or similar
Traceback (most recent call last):
  File "/Users/johnle/opt/anaconda3/lib/python3.8/site-packages/pymysql/connections.py", line 756, in _write_bytes
    self._sock.sendall(data)
BrokenPipeError: [Errno 32] Broken pipe

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
  File "/Users/johnle/opt/anaconda3/lib/python3.8/site-packages/sqlalchemy/pool/base.py", line 670, in _finalize_fairy
    fairy._reset(pool)
  File "/Users/johnle/opt/anaconda3/lib/python3.8/site-packages/sqlalchemy/pool/base.py", line 875, in _reset
    pool._dialect.do_rollback(self)
  File "/Users/johnle/opt/anaconda3/lib/python3.8/site-packages/sqlalchemy/engine/default.py", line 642, in do_rollback
    dbapi_connection.rollback()
  File "/Users/johnle/opt/anaconda3/lib/python3.8/site-packages/pymysql/connections.py", line 479, in rollback
    self._execute_command(COMMAND.COM_QUERY, "ROLLBACK")
  File "/Users/johnle/opt/anaconda3/lib/python3.8/site-packages/pymysql/connections.py", line 814, in _execute_command
    self._write_bytes(packet)
  File "/Users/johnle/opt/anaconda3/lib/python3.8/site-packages/pymysql/connections.py", line 759, in _write_bytes
    raise err.OperationalError(
pymysql.err.OperationalError: (2006, "MySQL server has gone away (BrokenPipeError(32, 'Broken pipe'))")

In [87]:
employment = pd.read_csv('/Users/johnle/Downloads/LDS2_Data_employment.csv')
employment.to_sql(name=table_name3, con=connection, if_exists='replace', index=False)

In [90]:
hobbies = pd.read_csv('/Users/johnle/Downloads/LDS2_Data_academics.csv')
hobbies.to_sql(name=table_name4, con=connection, if_exists='replace', index=False)

In [91]:
beef = pd.read_csv('/Users/johnle/Downloads/LDS2_Data_academics.csv')
beef.to_sql(name=table_name5, con=connection, if_exists='replace', index=False)

In [81]:
query1= "SELECT * FROM People"
query2= """

SELECT * FROM People
WHERE age = 21;
"""

In [82]:
result_df =pd.read_sql(query1, con=connection)
result_df_2 =pd.read_sql(query2, con=connection)

In [83]:
result_df

,Id,first_name,last_name,age,academic_id,employment_id,hobby_id,beef_id,restaurant_id
0,1,Lucy,Shichman,21,1,1,1,a,b
1,2,Himayat,Azizi,20,3,2,4,b,b
2,3,John,Le,21,2,4,5,d,c
3,4,Jay,Peetla,18,4,3,3,c,a
4,5,Franky,padilla coo,20,5,5,2,c,d

In [84]:
result_df_2

,Id,first_name,last_name,age,academic_id,employment_id,hobby_id,beef_id,restaurant_id
0,1,Lucy,Shichman,21,1,1,1,a,b
1,3,John,Le,21,2,4,5,d,c

In [ ]:
from py2neo import Graph

In [ ]:
graph = Graph("bolt://localhost:7687", auth=("neo4j", "password"))

In [104]:
for i in range(len(people)):
    row = people.iloc[i]
    print("CREATE (:PERSON {first_name:'" + row['first_name'] + "',last_name:" + row.last_name + ",age:'" + str(row.age)+"'})")

CREATE (:PERSON {first_name:'Lucy',last_name:Shichman,age:'21'})
CREATE (:PERSON {first_name:'Himayat',last_name:Azizi,age:'20'})
CREATE (:PERSON {first_name:'John',last_name:Le,age:'21'})
CREATE (:PERSON {first_name:'Jay',last_name:Peetla,age:'18'})
CREATE (:PERSON {first_name:'Franky',last_name:padilla coo,age:'20'})

In [98]:
for i in range(len(academics)):
    print(academics.iloc[i])

academic_id              1
major              Biology
university             UVA
school                 CAS
minor_existence       True
minor_name              ds
Name: 0, dtype: object
academic_id           2
major              Econ
university          UVA
school              CAS
minor_existence    True
minor_name           ds
Name: 1, dtype: object
academic_id           3
major                CS
university          UVA
school              CAS
minor_existence    True
minor_name           ds
Name: 2, dtype: object
academic_id                  4
major                       CS
university                 UVA
school             Engineering
minor_existence          False
minor_name                 NaN
Name: 3, dtype: object
academic_id                  5
major                       CS
university                 UVA
school             Engineering
minor_existence           True
minor_name                  ds
Name: 4, dtype: object